/*========================================================================================*
 * FILE:                     	GlobalDefine.h                   
 *========================================================================================*
 *
 * COPYRIGHT 2008-2015 BY 513 教研室
 *
 *========================================================================================*
 *
 * 名称:  
 *
 * 描述: 	
 *			
 *
 *				
 *
 *----------------------------------------------------------------------------------------*
 *          
 * HISTORY:   
 *
 *   Date    By     Comments
 * --------  -----  ------------------------------------------------------------
 * 2015/03/26  聂春雨	Created.
 *========================================================================================*/ 
#ifndef M_GlobalDefine_H
#define M_GlobalDefine_H


/*------------------------------------------------------------------------------*
 *								头文件
#include "B_GlobalDefine.h"
 *------------------------------------------------------------------------------*/
#include <stdio.h>
#include<string.h>
#include "stdlib.h"
#include "math.h"






#include "B_SelfDefine_type.h"
#include "B_SelfDefine_Function.h"
#include "B_SelfDefine_RemoteStruct.h"
#include "B_TimeSecondDelay.h"
#include "B_YKYC_Operate.h"
#include "B_Ballonet_Operate.h"
#include "B_Airscrew_Operate.h"
#include "B_Power_Operate.h"
#include "B_INSMain_Operate.h"
#include "B_Alt_Height_Receive.h"
#include "B_CtrlLaw_Operate.h"
#include "B_Vector_Operate.h"
 #include "B_001SecondDelay.h"







#include "main.h"
 #include "User_Uart.h"
 #include "Configuration.h"






 /*------------------------------------------------------------------------------*
 *								宏定义
 #define Modelname   3.1415926
 *------------------------------------------------------------------------------*/
 #define PI   3.1415927

/*------------------------------------------------------------------------------*
 *								结构体定义
 typedef struct  
{
	DEF_UINT16 m_Modelname;	
	
}Modelname;
 *------------------------------------------------------------------------------*/
 
/*------------------------------------------------------------------------------*
 *								变量定义
 extern DEF_UINT8 Modelname;	
 *------------------------------------------------------------------------------*/
 extern DEF_UINT32 g_TimeCount;					//周期计数器

 extern DEF_FLOAT32	g_CountTest[10];





 
/*------------------------------------------------------------------------------*
 *								函数声明
void Modelname();
 *------------------------------------------------------------------------------*/
 







#endif 

